import java from './java.png';
import Cplus from './Cplus.png';
import kotlin from './kotlin.png';
import scala from './scala.png';
import typescript from './typescript.png';
import SQL from './SQL.png';

const dataTwo = [

    {id: 1,
    names: 'Java',
    image: java,
    description: 'Java — язык программирования общего назначения. Относится к объектно-ориентированным языкам программирования, к языкам с сильной типизацией.'
    },

    {id: 2,
    names: 'C++',
    image: Cplus,
    description: 'C++ (читается си-плюс-плюс) — компилируемый, статически типизированный язык программирования общего назначения. Поддерживает такие парадигмы программирования, как процедурное программирование, объектно-ориентированное программирование, обобщённое программирование. Язык имеет богатую стандартную библиотеку, которая включает в себя распространённые контейнеры и алгоритмы, ввод-вывод, регулярные выражения, поддержку многопоточности и другие возможности.'
    },

    {id: 3,
    names: 'kotlin',
    image: kotlin,
    description: 'Kotlin — это относительно молодой язык от российской компании JetBrains. Появился он в 2011 году. На конференции Google I/O 2017 команда разработчиков Android сообщила, что Kotlin получил официальную поддержку для разработки Android-приложений.'
    },

    {id: 4,
    names: 'scala',
    image: scala,
    description: 'Scala -язык программирования общего назначения, обеспечивающий поддержку как объектно-ориентированного программирования, так и функционального программирования. Язык имеет сильную статическую систему типов. Разработанный, чтобы быть кратким, Многие дизайнерские решения Scala направлены на то, чтобы ответить на критику Java.'
    },
    
    {id: 5,
    names: 'typescript',
    image: typescript,
    description: 'TypeScript — это язык программирования со статической типизацией, позиционирующий себя как язык, расширяющий возможности JavaScript. Typescript код компилируется в JavaScript код, который можно запускать как на клиентской стороне (браузер), так и на стороне сервера (nodejs).'
    },

    {id: 6,
    names: 'SQL',
    image: SQL,
    description: 'Для извлечения данных из базы данных используется язык SQL. SQL — это язык программирования, который очень напоминает английский, но предназначен для программ управления базами данных. SQL используется в каждом запросе в Access. Понимание принципов работы SQL помогает создавать более точные запросы и упрощает исправление запросов, которые возвращают неправильные результаты.'
    },
]

export default dataTwo;